Catalogs/InformationCenterCommonData.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>InformationCenterCommonData</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Attachments</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalRef</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActualityBeginningDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActualityEndingDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Criticality</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InformationType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.InfoCentreInformationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/InformationCenterMessagesSales/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// GENERAL IMPLEMENTATION OF INFO CENTER MESSAGES PROCESSOR
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// SERVICE PROGRAMMING INTERFACE

// Generates the "InfoCenterGeneralData" catalog item according to the message
//
// Parameters:
// MessageBody - XDTODataObject - message body.
//
Procedure AddNotificationOfWish(MessageBody) Export
	
	SetPrivilegedMode(True);
	
	BeginTransaction();
	Try
		AddNotificationOfRequestToCatalog(MessageBody);
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
EndProcedure


////////////////////////////////////////////////////////////////////////////////
// SERVICE PROCEDURES AND FUNCTIONS

// Adds a notification if needed
//
// Parameters:
// MessageBody - XDTODataObject - message body.
//
Procedure AddNotificationOfRequestToCatalog(MessageBody)
	
	NotificationOfRequest                           = Catalogs.InformationCenterCommonData.CreateItem();
	NotificationOfRequest.ID             = MessageBody.id;
	NotificationOfRequest.Description              = MessageBody.name;
	NotificationOfRequest.ActualityBeginningDate    = MessageBody.startDate;
	NotificationOfRequest.ActualityEndingDate = MessageBody.endDate;
	NotificationOfRequest.InformationType             = InformationCenterServer.GetInformationTypeRef("NotificationOfRequest");
	NotificationOfRequest.Criticality               = MessageBody.criticality;
	NotificationOfRequest.Write();
	
EndProcedure
